apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_ledc.h
#define LEDC_DUTY_NUM_CH0    0x000003ff
#define LEDC_DUTY_NUM_CH0_M  (LEDC_DUTY_NUM_CH0_V << LEDC_DUTY_NUM_CH0_S)
#define LEDC_DUTY_NUM_CH0_V  0x000003ff
#define LEDC_DUTY_NUM_CH0_S  20

/* LEDC_DUTY_CYCLE_CH0 : R/W; bitpos: [19:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH5 on channel 5.
 */

#define LEDC_DUTY_CYCLE_CH0    0x000003ff
#define LEDC_DUTY_CYCLE_CH0_M  (LEDC_DUTY_CYCLE_CH0_V << LEDC_DUTY_CYCLE_CH0_S)
#define LEDC_DUTY_CYCLE_CH0_V  0x000003ff
#define LEDC_DUTY_CYCLE_CH0_S  10

/* LEDC_DUTY_SCALE_CH0 : R/W; bitpos: [9:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel 5.
 */

#define LEDC_DUTY_SCALE_CH0    0x000003ff
#define LEDC_DUTY_SCALE_CH0_M  (LEDC_DUTY_SCALE_CH0_V << LEDC_DUTY_SCALE_CH0_S)
#define LEDC_DUTY_SCALE_CH0_V  0x000003ff
#define LEDC_DUTY_SCALE_CH0_S  0

/* LEDC_CH5_DUTY_R_REG register
 * Current duty cycle for channel 5
 */

#define LEDC_CH5_DUTY_R_REG (DR_REG_LEDC_BASE + 0x74)

/* LEDC_DUTY_R_CH0 : RO; bitpos: [18:0]; default: 0;
 * This register stores the current duty of output signal on channel 5.
 */

#define LEDC_DUTY_R_CH0    0x0007ffff
#define LEDC_DUTY_R_CH0_M  (LEDC_DUTY_R_CH0_V << LEDC_DUTY_R_CH0_S)
#define LEDC_DUTY_R_CH0_V  0x0007ffff
#define LEDC_DUTY_R_CH0_S  0

/* LEDC_CH6_CONF0_REG register
 * Configuration register 0 for channel 6
 */

#define LEDC_CH6_CONF0_REG (DR_REG_LEDC_BASE + 0x78)

/* LEDC_OVF_CNT_RESET_ST_CH0 : R/WTC/SC; bitpos: [17]; default: 0;
 * This is the status bit of LEDC_OVF_CNT_RESET_CH6.
 */

#define LEDC_OVF_CNT_RESET_ST_CH0    (BIT(17))
#define LEDC_OVF_CNT_RESET_ST_CH0_M  (LEDC_OVF_CNT_RESET_ST_CH0_V << LEDC_OVF_CNT_RESET_ST_CH0_S)
#define LEDC_OVF_CNT_RESET_ST_CH0_V  0x00000001
#define LEDC_OVF_CNT_RESET_ST_CH0_S  17

/* LEDC_OVF_CNT_RESET_CH0 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel 6.
 */

#define LEDC_OVF_CNT_RESET_CH0    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH0_M  (LEDC_OVF_CNT_RESET_CH0_V << LEDC_OVF_CNT_RESET_CH0_S)
#define LEDC_OVF_CNT_RESET_CH0_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH0_S  16

/* LEDC_OVF_CNT_EN_CH0 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel 6.
 */

#define LEDC_OVF_CNT_EN_CH0    (BIT(15))
#define LEDC_OVF_CNT_EN_CH0_M  (LEDC_OVF_CNT_EN_CH0_V << LEDC_OVF_CNT_EN_CH0_S)
#define LEDC_OVF_CNT_EN_CH0_V  0x00000001
#define LEDC_OVF_CNT_EN_CH0_S  15

/* LEDC_OVF_NUM_CH0 : R/W; bitpos: [14:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus 1.
 *
 * The LEDC_OVF_CNT_CH6_INT interrupt will be triggered when channel 6
 * overflows for (LEDC_OVF_NUM_CH6 + 1) times.
 */

#define LEDC_OVF_NUM_CH0    0x000003ff
#define LEDC_OVF_NUM_CH0_M  (LEDC_OVF_NUM_CH0_V << LEDC_OVF_NUM_CH0_S)
#define LEDC_OVF_NUM_CH0_V  0x000003ff
#define LEDC_OVF_NUM_CH0_S  5

/* LEDC_PARA_UP_CH0 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH6, LEDC_DUTY_START_CH6,
 * LEDC_SIG_OUT_EN_CH6, LEDC_TIMER_SEL_CH6, LEDC_DUTY_NUM_CH6,
 * LEDC_DUTY_CYCLE_CH6, LEDC_DUTY_SCALE_CH6, LEDC_DUTY_INC_CH6, and
 * LEDC_OVF_CNT_EN_CH6 fields for channel 6, and will be automatically
 * cleared by hardware.
 */

#define LEDC_PARA_UP_CH0    (BIT(4))
#define LEDC_PARA_UP_CH0_M  (LEDC_PARA_UP_CH0_V << LEDC_PARA_UP_CH0_S)
#define LEDC_PARA_UP_CH0_V  0x00000001
#define LEDC_PARA_UP_CH0_S  4

/* LEDC_IDLE_LV_CH0 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 6 is inactive
 * (when LEDC_SIG_OUT_EN_CH6 is 0).
 */

#define LEDC_IDLE_LV_CH0    (BIT(3))
#define LEDC_IDLE_LV_CH0_M  (LEDC_IDLE_LV_CH0_V << LEDC_IDLE_LV_CH0_S)
#define LEDC_IDLE_LV_CH0_V  0x00000001
#define LEDC_IDLE_LV_CH0_S  3

/* LEDC_SIG_OUT_EN_CH0 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel 6.
 */

#define LEDC_SIG_OUT_EN_CH0    (BIT(2))
#define LEDC_SIG_OUT_EN_CH0_M  (LEDC_SIG_OUT_EN_CH0_V << LEDC_SIG_OUT_EN_CH0_S)
#define LEDC_SIG_OUT_EN_CH0_V  0x00000001
#define LEDC_SIG_OUT_EN_CH0_S  2

/* LEDC_TIMER_SEL_CH0 : R/W; bitpos: [1:0]; default: 0;
 * This field is used to select one of timers for channel 6.
 *
 * 0: select timer0
 *
 * 1: select timer1
 *
 * 2: select timer2
 *
 * 3: select timer3
 */

#define LEDC_TIMER_SEL_CH0    0x00000003
#define LEDC_TIMER_SEL_CH0_M  (LEDC_TIMER_SEL_CH0_V << LEDC_TIMER_SEL_CH0_S)
#define LEDC_TIMER_SEL_CH0_V  0x00000003
#define LEDC_TIMER_SEL_CH0_S  0

/* LEDC_CH6_HPOINT_REG register
 * High point register for channel 6
 */

#define LEDC_CH6_HPOINT_REG (DR_REG_LEDC_BASE + 0x7c)

/* LEDC_HPOINT_CH0 : R/W; bitpos: [13:0]; default: 0;
 * The output value changes to high when the selected timers has reached the
 * value specified by this register.
 */

#define LEDC_HPOINT_CH0    0x00003fff
#define LEDC_HPOINT_CH0_M  (LEDC_HPOINT_CH0_V << LEDC_HPOINT_CH0_S)
#define LEDC_HPOINT_CH0_V  0x00003fff
#define LEDC_HPOINT_CH0_S  0

/* LEDC_CH6_DUTY_REG register
 * Initial duty cycle for channel 6
 */

#define LEDC_CH6_DUTY_REG (DR_REG_LEDC_BASE + 0x80)

/* LEDC_DUTY_CH0 : R/W; bitpos: [18:0]; default: 0;
 * This register is used to change the output duty by controlling the Lpoint.
 *
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */

#define LEDC_DUTY_CH0    0x0007ffff
#define LEDC_DUTY_CH0_M  (LEDC_DUTY_CH0_V << LEDC_DUTY_CH0_S)
#define LEDC_DUTY_CH0_V  0x0007ffff
#define LEDC_DUTY_CH0_S  0

/* LEDC_CH6_CONF1_REG register
 * Configuration register 1 for channel 6
 */

#define LEDC_CH6_CONF1_REG (DR_REG_LEDC_BASE + 0x84)

/* LEDC_DUTY_START_CH0 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH6_CONF1_REG will start to take effect
 * when this bit is set to 1.
 */

#define LEDC_DUTY_START_CH0    (BIT(31))
#define LEDC_DUTY_START_CH0_M  (LEDC_DUTY_START_CH0_V << LEDC_DUTY_START_CH0_S)
#define LEDC_DUTY_START_CH0_V  0x00000001
#define LEDC_DUTY_START_CH0_S  31

/* LEDC_DUTY_INC_CH0 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 6. 1: Increase; 0: Decrease.
 */

#define LEDC_DUTY_INC_CH0    (BIT(30))
#define LEDC_DUTY_INC_CH0_M  (LEDC_DUTY_INC_CH0_V << LEDC_DUTY_INC_CH0_S)
#define LEDC_DUTY_INC_CH0_V  0x00000001
#define LEDC_DUTY_INC_CH0_S  30

/* LEDC_DUTY_NUM_CH0 : R/W; bitpos: [29:20]; default: 0;
 * This register is used to control the number of times the duty cycle will
 * be changed.
 */

