apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_ledc.h
#define LEDC_TIMER0_CNT    0x00003fff
#define LEDC_TIMER0_CNT_M  (LEDC_TIMER0_CNT_V << LEDC_TIMER0_CNT_S)
#define LEDC_TIMER0_CNT_V  0x00003fff
#define LEDC_TIMER0_CNT_S  0

/* LEDC_TIMER2_CONF_REG register
 * Timer 2 configuration
 */

#define LEDC_TIMER2_CONF_REG (DR_REG_LEDC_BASE + 0xb0)

/* LEDC_TIMER0_PARA_UP : WT; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER2 and LEDC_TIMER2_DUTY_RES.
 */

#define LEDC_TIMER0_PARA_UP    (BIT(25))
#define LEDC_TIMER0_PARA_UP_M  (LEDC_TIMER0_PARA_UP_V << LEDC_TIMER0_PARA_UP_S)
#define LEDC_TIMER0_PARA_UP_V  0x00000001
#define LEDC_TIMER0_PARA_UP_S  25

/* LEDC_TICK_SEL_TIMER0 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 2. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 *
 * 1'h0: SLOW_CLK 1'h1: REF_TICK
 */

#define LEDC_TICK_SEL_TIMER0    (BIT(24))
#define LEDC_TICK_SEL_TIMER0_M  (LEDC_TICK_SEL_TIMER0_V << LEDC_TICK_SEL_TIMER0_S)
#define LEDC_TICK_SEL_TIMER0_V  0x00000001
#define LEDC_TICK_SEL_TIMER0_S  24

/* LEDC_TIMER0_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 2. The counter will show 0 after reset.
 */

#define LEDC_TIMER0_RST    (BIT(23))
#define LEDC_TIMER0_RST_M  (LEDC_TIMER0_RST_V << LEDC_TIMER0_RST_S)
#define LEDC_TIMER0_RST_V  0x00000001
#define LEDC_TIMER0_RST_S  23

/* LEDC_TIMER0_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer 2.
 */

#define LEDC_TIMER0_PAUSE    (BIT(22))
#define LEDC_TIMER0_PAUSE_M  (LEDC_TIMER0_PAUSE_V << LEDC_TIMER0_PAUSE_S)
#define LEDC_TIMER0_PAUSE_V  0x00000001
#define LEDC_TIMER0_PAUSE_S  22

/* LEDC_CLK_DIV_TIMER0 : R/W; bitpos: [21:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer 2.
 *
 * The least significant eight bits represent the fractional part.
 */

#define LEDC_CLK_DIV_TIMER0    0x0003ffff
#define LEDC_CLK_DIV_TIMER0_M  (LEDC_CLK_DIV_TIMER0_V << LEDC_CLK_DIV_TIMER0_S)
#define LEDC_CLK_DIV_TIMER0_V  0x0003ffff
#define LEDC_CLK_DIV_TIMER0_S  4

/* LEDC_TIMER0_DUTY_RES : R/W; bitpos: [3:0]; default: 0;
 * This register is used to control the range of the counter in timer 2.
 */

#define LEDC_TIMER0_DUTY_RES    0x0000000f
#define LEDC_TIMER0_DUTY_RES_M  (LEDC_TIMER0_DUTY_RES_V << LEDC_TIMER0_DUTY_RES_S)
#define LEDC_TIMER0_DUTY_RES_V  0x0000000f
#define LEDC_TIMER0_DUTY_RES_S  0

/* LEDC_TIMER2_VALUE_REG register
 * Timer 2 current counter value
 */

#define LEDC_TIMER2_VALUE_REG (DR_REG_LEDC_BASE + 0xb4)

/* LEDC_TIMER0_CNT : RO; bitpos: [13:0]; default: 0;
 * This register stores the current counter value of timer 2.
 */

#define LEDC_TIMER0_CNT    0x00003fff
#define LEDC_TIMER0_CNT_M  (LEDC_TIMER0_CNT_V << LEDC_TIMER0_CNT_S)
#define LEDC_TIMER0_CNT_V  0x00003fff
#define LEDC_TIMER0_CNT_S  0

/* LEDC_TIMER3_CONF_REG register
 * Timer 3 configuration
 */

#define LEDC_TIMER3_CONF_REG (DR_REG_LEDC_BASE + 0xb8)

/* LEDC_TIMER0_PARA_UP : WT; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER3 and LEDC_TIMER3_DUTY_RES.
 */

#define LEDC_TIMER0_PARA_UP    (BIT(25))
#define LEDC_TIMER0_PARA_UP_M  (LEDC_TIMER0_PARA_UP_V << LEDC_TIMER0_PARA_UP_S)
#define LEDC_TIMER0_PARA_UP_V  0x00000001
#define LEDC_TIMER0_PARA_UP_S  25

/* LEDC_TICK_SEL_TIMER0 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 3. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 *
 * 1'h0: SLOW_CLK 1'h1: REF_TICK
 */

#define LEDC_TICK_SEL_TIMER0    (BIT(24))
#define LEDC_TICK_SEL_TIMER0_M  (LEDC_TICK_SEL_TIMER0_V << LEDC_TICK_SEL_TIMER0_S)
#define LEDC_TICK_SEL_TIMER0_V  0x00000001
#define LEDC_TICK_SEL_TIMER0_S  24

/* LEDC_TIMER0_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 3. The counter will show 0 after reset.
 */

#define LEDC_TIMER0_RST    (BIT(23))
#define LEDC_TIMER0_RST_M  (LEDC_TIMER0_RST_V << LEDC_TIMER0_RST_S)
#define LEDC_TIMER0_RST_V  0x00000001
#define LEDC_TIMER0_RST_S  23

/* LEDC_TIMER0_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer 3.
 */

#define LEDC_TIMER0_PAUSE    (BIT(22))
#define LEDC_TIMER0_PAUSE_M  (LEDC_TIMER0_PAUSE_V << LEDC_TIMER0_PAUSE_S)
#define LEDC_TIMER0_PAUSE_V  0x00000001
#define LEDC_TIMER0_PAUSE_S  22

/* LEDC_CLK_DIV_TIMER0 : R/W; bitpos: [21:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer 3.
 *
 * The least significant eight bits represent the fractional part.
 */

#define LEDC_CLK_DIV_TIMER0    0x0003ffff
#define LEDC_CLK_DIV_TIMER0_M  (LEDC_CLK_DIV_TIMER0_V << LEDC_CLK_DIV_TIMER0_S)
#define LEDC_CLK_DIV_TIMER0_V  0x0003ffff
#define LEDC_CLK_DIV_TIMER0_S  4

/* LEDC_TIMER0_DUTY_RES : R/W; bitpos: [3:0]; default: 0;
 * This register is used to control the range of the counter in timer 3.
 */

#define LEDC_TIMER0_DUTY_RES    0x0000000f
#define LEDC_TIMER0_DUTY_RES_M  (LEDC_TIMER0_DUTY_RES_V << LEDC_TIMER0_DUTY_RES_S)
#define LEDC_TIMER0_DUTY_RES_V  0x0000000f
#define LEDC_TIMER0_DUTY_RES_S  0

/* LEDC_TIMER3_VALUE_REG register
 * Timer 3 current counter value
 */

#define LEDC_TIMER3_VALUE_REG (DR_REG_LEDC_BASE + 0xbc)

/* LEDC_TIMER0_CNT : RO; bitpos: [13:0]; default: 0;
 * This register stores the current counter value of timer 3.
 */

#define LEDC_TIMER0_CNT    0x00003fff
#define LEDC_TIMER0_CNT_M  (LEDC_TIMER0_CNT_V << LEDC_TIMER0_CNT_S)
#define LEDC_TIMER0_CNT_V  0x00003fff
#define LEDC_TIMER0_CNT_S  0

/* LEDC_INT_RAW_REG register
 * Raw interrupt status
 */

#define LEDC_INT_RAW_REG (DR_REG_LEDC_BASE + 0xc0)

/* LEDC_OVF_CNT_CH7_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 * Interrupt raw bit for channel 7. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH7.
 */

#define LEDC_OVF_CNT_CH7_INT_RAW    (BIT(19))
#define LEDC_OVF_CNT_CH7_INT_RAW_M  (LEDC_OVF_CNT_CH7_INT_RAW_V << LEDC_OVF_CNT_CH7_INT_RAW_S)
#define LEDC_OVF_CNT_CH7_INT_RAW_V  0x00000001
#define LEDC_OVF_CNT_CH7_INT_RAW_S  19

/* LEDC_OVF_CNT_CH6_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 * Interrupt raw bit for channel 6. Triggered when the ovf_cnt has reached
 * the value specified by LEDC_OVF_NUM_CH6.
 */

